1atabey1/esp32tricore-dap/main/network/web_server.c
    // Fixed value: USB DAP/COM is always disabled
    cJSON_AddBoolToObject(root, "disableUsbDapCom", true);

    const char *sys_info = cJSON_PrintUnformatted(root);
    httpd_resp_sendstr(req, sys_info);

    free((void *)sys_info);
    cJSON_Delete(root);

    return ESP_OK;
}


static void get_filename_from_path(const char *path, char *filename, size_t filename_len)
{
    const char *last_slash = strrchr(path, '/');
    const char *src = last_slash ? last_slash + 1 : path;
    strncpy(filename, src, filename_len - 1);
    filename[filename_len - 1] = '\0';
}

static esp_err_t file_upload_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    struct stat file_stat;
    char filepath[128] = CFG_FILE_PATH;
    size_t prefix_len = strlen(CFG_FILE_PATH);

    get_filename_from_path(req->uri, filepath + prefix_len, sizeof(filepath) - prefix_len);

    if (stat(filepath, &file_stat) == 0) {
        ESP_LOGE(TAG, "File already exists : %s", filepath);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File already exists!");
        return ESP_FAIL;
    }

    // Open the file for writing
    FILE *fp = fopen(filepath, "w");
    if (fp == NULL) {
        ESP_LOGE(TAG, "Failed to open file for writing");
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to open file");
        return ESP_FAIL;
    }

    char buf[1024];
    size_t remaining = req->content_len;
    const uint8_t poll_period = 10; /* ms */
    uint16_t try_count = 1000 / poll_period; /* 1 second timeout */

    while (try_count) {

        ESP_LOGI(TAG, "Remaining size : %d", remaining);

        // Read a chunk of data from the request
        int received = httpd_req_recv(req, buf, MIN(remaining, sizeof(buf)));
        if (received <= 0) {
            if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                /* Retry if timeout occurred */
                continue;
            }

            /* In case of unrecoverable error, close and delete the unfinished file*/
            fclose(fp);
            unlink(filepath);

            ESP_LOGE(TAG, "File reception failed!");
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to receive file");
            return ESP_FAIL;
        }

        /* Write buffer content to file on storage */
        if (received != fwrite(buf, 1, received, fp)) {
            /* Couldn't write everything to file! Storage may be full? */
            fclose(fp);
            unlink(filepath);

            ESP_LOGE(TAG, "File write failed!");
            /* Respond with 500 Internal Server Error */
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to write file to storage");
            return ESP_FAIL;
        }

        /* Keep track of remaining size of the file left to be uploaded */
        remaining -= received;
        if (!remaining) {
            break;
        }

        /* If still there is remaining data, something might be wrong. */
        try_count--;
        vTaskDelay(pdMS_TO_TICKS(poll_period));
    }

    // Close the file
    fclose(fp);
    ESP_LOGI(TAG, "File received: %s", filepath);

    storage_update_target_struct();

    // Send the response indicating success
    httpd_resp_sendstr(req, "File uploaded successfully");

    return ESP_OK;
}

static esp_err_t file_delete_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char filepath[128] = {0};
    char filename[64] = {0};

    get_filename_from_path(req->uri, filename, sizeof(filename));

    snprintf(filepath, sizeof(filepath), "%s%s", CFG_FILE_PATH, filename);

    ESP_LOGI(TAG, "filepath:%s", filepath);

    struct stat file_stat;

    if (stat(filepath, &file_stat) != 0) {
        ESP_LOGE(TAG, "File not exists : %s", filepath);
        /* Respond with 400 Bad Request */
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File not exists!");
        return ESP_FAIL;
    }

    unlink(filepath);

    storage_update_target_struct();

    // Send the response indicating success
    httpd_resp_sendstr(req, "File deleted successfully");

    return ESP_OK;
}
#if 0
static esp_err_t logic_analyzer_data_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char query_str[64];
    if (httpd_req_get_url_query_str(req, query_str, sizeof(query_str)) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get query string");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing query parameters");
        return ESP_FAIL;
    }

    int num_channels = 0;
    int num_samples = 0;
    
    char param[32];
    if (httpd_query_key_value(query_str, "channels", param, sizeof(param)) == ESP_OK) {
        num_channels = atoi(param);
    }
    if (httpd_query_key_value(query_str, "samples", param, sizeof(param)) == ESP_OK) {
        num_samples = atoi(param);
    }

    if (num_channels <= 0 || num_samples <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid number of channels or samples");
        return ESP_FAIL;
    }

    // Create a JSON object to hold the data
    cJSON *root = cJSON_CreateObject();
    cJSON *data_array = cJSON_CreateArray();

    // Call the data acquisition function (currently generates random data)
    // NOTE: To get real data, replace this function call with your actual data acquisition function.
    get_random_logic_analyzer_data(num_channels, num_samples, data_array);

    cJSON_AddItemToObject(root, "data", data_array);
    
    char *json_string = cJSON_PrintUnformatted(root);
    if (json_string == NULL) {
        ESP_LOGE(TAG, "Failed to create JSON string");
        cJSON_Delete(root);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Failed to create JSON response");
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "application/json");
    esp_err_t err = httpd_resp_send(req, json_string, HTTPD_RESP_USE_STRLEN);
    
    free(json_string);
    cJSON_Delete(root);

