1atabey1/esp32tricore-dap/main/network/web_server.c
    httpd_resp_sendstr(req, "Test started");
    return ESP_OK;
}

// Handler: /test/status
static esp_err_t test_status_handler(httpd_req_t *req) {
    //if (check_auth(req) != ESP_OK) return ESP_OK;

    char resp[128];
    snprintf(resp, sizeof(resp), "{\"status\": \"%s\", \"test\": \"%s\"}", g_test_status, g_current_test_name);

    ESP_LOGI(TAG, "test_status_handler: %s", resp);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, resp, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// Handler: /test/result
static esp_err_t test_result_handler(httpd_req_t *req) {
    //if (check_auth(req) != ESP_OK) return ESP_OK;

    ESP_LOGI(TAG, "test_result_handler: %s", g_test_result_json);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, g_test_result_json, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

static esp_err_t la_status_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    // Call read_capture_status() to get fresh status
    read_capture_status();
    
    // A C-style string buffer to hold the JSON response
    char resp_buf[128]; 
    
    uint32_t trigger_pos = 128 * gbl_trigger_position / 100;
    if (trigger_pos > 127) {
        trigger_pos = 127;
    }
    trigger_pos = 127 - trigger_pos; // calculate from beginning
    uint32_t trigger_pos_in_samples = 64 * 1024 - trigger_pos * 512 - 14;
    
    // Format the JSON string
    snprintf(resp_buf, sizeof(resp_buf), "{\"triggered\": %s, \"all_captured\": %s, \"wr_addr_stop_position\":%" PRIu32 ", \"trigger_position\":%" PRIu32 "}",
             gbl_triggered_flag ? "true" : "false",
             gbl_all_captured_flag? "true" : "false",
             gbl_wr_addr_stop_position,
             trigger_pos_in_samples);
    
    ESP_LOGI(TAG, "la_status_handler: triggered=%s wr_addr=%d",
             gbl_triggered_flag ? "true" : "false",
             gbl_wr_addr_stop_position);

    // Send the response
    httpd_resp_send(req, resp_buf, HTTPD_RESP_USE_STRLEN);
    
    return ESP_OK;
}

static esp_err_t la_instant_capture_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    ESP_LOGI(TAG, "=== la_instant_capture_handler() called ===");
    
    // 1. Start capture immediately (force trigger)
    start_capture(true);
#if 1    
    // 2. Wait for capture to complete (polling loop)
    ESP_LOGI(TAG, "la_instant_capture_handler: Waiting for capture completion...");
    
    int poll_count = 0;
    while (1) {
        read_capture_status();
        
        if (gbl_triggered_flag) {
            ESP_LOGI(TAG, "la_instant_capture_handler: Capture complete after %d polls", poll_count);
            break;
        }
        
        poll_count++;
        vTaskDelay(pdMS_TO_TICKS(10));
        
        // Safety timeout (~2 seconds)
        if (poll_count > 200) {
            ESP_LOGE(TAG, "la_instant_capture_handler: Timeout waiting for capture");
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Capture timeout");
            return ESP_FAIL;
        }
    }
#endif
    // 3. Read and return data
    ESP_LOGI(TAG, "la_instant_capture_handler: Calling read_and_return_capture()...");
    extern void read_and_return_capture(void);
    read_and_return_capture();
    
    // 4. Send data to browser
    ESP_LOGI(TAG, "la_instant_capture_handler: Sending data...");

    int64_t t_start = esp_timer_get_time();
    esp_err_t ret = httpd_resp_send(req, (const char *)(psram_buffer + CAP_DATA_START), ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START);
    int64_t t_end = esp_timer_get_time();

    float duration = (float)(t_end - t_start) / 1000000.0f;
    float speed = 0;
    if (duration > 0.000001f) {
        // Megabits per second (Mbps)
        speed = (float)(ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START) * 8.0f / 1000000.0f / duration;
    }

    ESP_LOGI(TAG, "la_instant_capture_handler: Sent %d bytes in %.3f s. Speed: %.2f mbps",
             (int)(ICE_CAPTURE_BUFFER_SIZE - CAP_DATA_START), duration, speed);
    
    return ret;
}

static esp_err_t la_configure_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;
    char json_buf[512];
    cJSON *root = set_handler_start(req, json_buf, sizeof(json_buf));
    if (!root) {
        return ESP_FAIL;
    }

    cJSON *sampleRate = cJSON_GetObjectItem(root, "sampleRate");
    cJSON *triggerPosition = cJSON_GetObjectItem(root, "triggerPosition");
    cJSON *triggerEnabled = cJSON_GetObjectItem(root, "triggerEnabled");
    cJSON *triggerModeOR = cJSON_GetObjectItem(root, "triggerModeOR");
    cJSON *captureInternalTestSignal = cJSON_GetObjectItem(root, "captureInternalTestSignal");
    cJSON *measureMode = cJSON_GetObjectItem(root, "measureMode");

    if (sampleRate) {
        const uint32_t requested_rate = (uint32_t)sampleRate->valuedouble;

        /* FPGA divider 0..254 samples at 132 MHz / (divider + 1).
         * Divider 255 is a special 264 MHz mode. Store and report the
         * effective rate so browser time/frequency measurements use the same
         * clock that produced the samples. */
        if (requested_rate >= 264000000) {
            gbl_sample_rate_reg = 255; gbl_sample_rate = 264000000;
        } else if (requested_rate >= 132000000) {
            gbl_sample_rate_reg = 0;   gbl_sample_rate = 132000000;
        } else if (requested_rate >= 66000000) {
            gbl_sample_rate_reg = 1;   gbl_sample_rate = 66000000;
        } else if (requested_rate >= 33000000) {
            gbl_sample_rate_reg = 3;   gbl_sample_rate = 33000000;
        } else if (requested_rate >= 22000000) {
            gbl_sample_rate_reg = 5;   gbl_sample_rate = 22000000;
        } else if (requested_rate >= 16500000) {
            gbl_sample_rate_reg = 7;   gbl_sample_rate = 16500000;
        } else if (requested_rate >= 11000000) {
            gbl_sample_rate_reg = 11;  gbl_sample_rate = 11000000;
        } else if (requested_rate >= 6000000) {
            gbl_sample_rate_reg = 21;  gbl_sample_rate = 6000000;
        } else if (requested_rate >= 3000000) {
            gbl_sample_rate_reg = 43;  gbl_sample_rate = 3000000;
        } else if (requested_rate >= 2000000) {
            gbl_sample_rate_reg = 65;  gbl_sample_rate = 2000000;
        } else if (requested_rate >= 1000000) {
            gbl_sample_rate_reg = 131; gbl_sample_rate = 1000000;
        } else {
            gbl_sample_rate_reg = 254; gbl_sample_rate = 132000000 / 255;
        }

        ESP_LOGI(TAG, "LA Config: Requested Rate = %u, Effective Rate = %u, Reg = %u",
                 requested_rate, gbl_sample_rate, gbl_sample_rate_reg);
    }
    if (triggerPosition) {
        gbl_trigger_position = triggerPosition->valueint;
        ESP_LOGI(TAG, "LA Config: Trigger Position = %u%%", gbl_trigger_position);
    }
    if (triggerEnabled) {
        gbl_trigger_enabled = cJSON_IsTrue(triggerEnabled);
        ESP_LOGI(TAG, "LA Config: Trigger Enabled = %s", gbl_trigger_enabled ? "true" : "false");
    }
    if (triggerModeOR) {
        gbl_trigger_mode_or = cJSON_IsTrue(triggerModeOR);
        ESP_LOGI(TAG, "LA Config: Trigger Mode OR = %s", gbl_trigger_mode_or ? "true" : "false");
    }
    if (captureInternalTestSignal) {
        gbl_capture_internal_test_signal = cJSON_IsTrue(captureInternalTestSignal);
        ESP_LOGI(TAG, "LA Config: Capture Internal Test Signal = %s", gbl_capture_internal_test_signal ? "ON" : "OFF");
        set_la_input_sel(gbl_capture_internal_test_signal);
    }
    if (measureMode) {
        gbl_la_measure_mode = cJSON_IsTrue(measureMode);
        ESP_LOGI(TAG, "LA Config: Measure Mode = %s", gbl_la_measure_mode ? "ON" : "OFF");
    }

    cJSON *channels = cJSON_GetObjectItem(root, "channels");
    if (channels && cJSON_IsArray(channels)) {
        int array_size = cJSON_GetArraySize(channels);
        for (int i = 0; i < array_size && i < 16; i++) {
            cJSON *item = cJSON_GetArrayItem(channels, i);
            if (cJSON_IsString(item)) {
                if (strcmp(item->valuestring, "disabled") == 0) gbl_channel_triggers[i] = TRIGGER_DISABLED;
                else if (strcmp(item->valuestring, "rising") == 0) gbl_channel_triggers[i] = TRIGGER_RISING;
                else if (strcmp(item->valuestring, "falling") == 0) gbl_channel_triggers[i] = TRIGGER_FALLING;
                else if (strcmp(item->valuestring, "crossing") == 0) gbl_channel_triggers[i] = TRIGGER_CROSSING;
                else if (strcmp(item->valuestring, "high") == 0) gbl_channel_triggers[i] = TRIGGER_HIGH;
                else if (strcmp(item->valuestring, "low") == 0) gbl_channel_triggers[i] = TRIGGER_LOW;
                else gbl_channel_triggers[i] = TRIGGER_DISABLED;
                ESP_LOGI(TAG, "LA Config: CH%d Trigger = %s", i+1, item->valuestring);
            }
        }
    }

