1atabey1/esp32tricore-dap/main/network/web_server.c
    uart_websocket_get_debug_json(json, sizeof(json));
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, json);
    return ESP_OK;
}

static esp_err_t version_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    const esp_app_desc_t *app = esp_app_get_description();

    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "project_name",          app->project_name);
    cJSON_AddStringToObject(root, "firmware_version",      app->version);
    cJSON_AddStringToObject(root, "hardware_version",      HW_VERSION);
    cJSON_AddStringToObject(root, "idf_version",           app->idf_ver);
    cJSON_AddStringToObject(root, "build_date",            app->date);
    cJSON_AddStringToObject(root, "build_time",            app->time);
    cJSON_AddStringToObject(root, "main_git_commit",       MAIN_GIT_COMMIT);
    cJSON_AddStringToObject(root, "blackmagic_git_commit", FIRMWARE_VERSION);

    char *json_str = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, json_str);
    free(json_str);

    return ESP_OK;
}

esp_err_t reset_to_factory_handler(httpd_req_t *req) {
    if (check_auth(req) != ESP_OK) return ESP_OK;

    ESP_LOGW(TAG, "Factory Reset Initialized by User");

    storage_erase_key(PORT_A_CFG_KEY);
    storage_erase_key(PORT_B_CFG_KEY);
    storage_erase_key(PORT_C_CFG_KEY);
    storage_erase_key(PORT_D_CFG_KEY);
    storage_erase_key(TARGET_VOLTAGE_KEY);
    storage_erase_key(SW_MCU_KEY);
    storage_erase_key(WIFI_MODE_KEY);
    storage_erase_key(WIFI_SSID_KEY);
    storage_erase_key(WIFI_PASS_KEY);
    storage_erase_key(WIFI_AP_SSID_KEY);
    storage_erase_key(WIFI_AP_PASS_KEY);
    storage_erase_key(OTA_URL_KEY);
    storage_erase_key(MCU_INTERFACE_KEY);
    
    // Also erase web credentials so it defaults to admin:admin
    storage_erase_key(WEB_USER_KEY);
    storage_erase_key(WEB_PASS_KEY);

    // Erase UART settings
    storage_erase_key(UART_BAUD_KEY);
    storage_erase_key(UART_DATA_BITS_KEY);
    storage_erase_key(UART_STOP_BITS_KEY);
    storage_erase_key(UART_PARITY_KEY);
    storage_erase_key(UART_PORT_SEL_KEY);
    storage_erase_key(DISABLE_USB_DAP_KEY);

    httpd_resp_sendstr(req, "Factory reset complete. Rebooting...");
    vTaskDelay(3000 / portTICK_PERIOD_MS);
    esp_restart();
    return ESP_OK;
}

/*
 * Tee the log into the HTTP response while a DAP run is in progress.
 *
 * The serial console is not a reliable transport for these runs on this bench:
 * the board reaches WSL over usbip, and a burst of a few hundred log lines
 * loses most of them (vhci_hcd reports urb->status -104 while it happens),
 * while the once-per-30s heartbeat survives.  That made a passing bring-up
 * indistinguishable from a silent one.  Returning the report in the response
 * body removes the console from the loop entirely.
 *
 * Other tasks logging at the same time land in the buffer too, which is
 * harmless - their lines are tagged - and the hook is removed before the
 * response is sent.
 */
#define DAP_CAPTURE_BYTES (96 * 1024)

/*
 * One socket write per pass of the trace stream loop.  4 kB is four TRAM
 * paragraphs plus their headers, so a caught-up drain empties in a single
 * write and a backlog drains without a delay between writes.
 */
#define DAP_TRACE_CHUNK_BYTES 4096

/*
 * How many empty 5 ms passes to wait after the drain stops before closing the
 * stream.  The drain task may still be finishing a paragraph when the stop
 * arrives, and cutting the connection there would lose it.
 */
#define DAP_TRACE_DRAIN_TAIL_PASSES 20

/*
 * How many empty 5 ms passes to wait while the drain is still running before
 * returning anyway.  Half a second of silence means nothing is being traced,
 * and there is no reason to keep the single-threaded web server occupied.
 */
#define DAP_TRACE_IDLE_PASSES 100

/*
 * Longest a single stream response may run.  esp_http_server handles requests
 * from one task, so this is how long every other endpoint waits behind it.
 */
#define DAP_TRACE_STREAM_MAX_MS 1000

static char           *s_dap_cap;
static size_t          s_dap_cap_len;
static vprintf_like_t  s_dap_cap_prev;

static int dap_capture_vprintf(const char *format, va_list args)
{
    if (s_dap_cap) {
        va_list copy;
        va_copy(copy, args);
        const size_t room = DAP_CAPTURE_BYTES - 1 - s_dap_cap_len;
        if (room > 1) {
            const int n = vsnprintf(s_dap_cap + s_dap_cap_len, room, format, copy);
            if (n > 0) {
                s_dap_cap_len += ((size_t)n < room) ? (size_t)n : room - 1;
            }
        }
        va_end(copy);
    }
    return s_dap_cap_prev ? s_dap_cap_prev(format, args) : 0;
}

static void dap_capture_begin(void)
{
    s_dap_cap_len = 0;
    s_dap_cap = heap_caps_malloc(DAP_CAPTURE_BYTES, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!s_dap_cap) {
        return;
    }
    s_dap_cap[0] = '\0';
    s_dap_cap_prev = esp_log_set_vprintf(dap_capture_vprintf);
}

/* Restore logging and send whatever was captured, with `verdict` on the end. */
static void dap_capture_end(httpd_req_t *req, const char *verdict)
{
    if (s_dap_cap) {
        esp_log_set_vprintf(s_dap_cap_prev);
        s_dap_cap_prev = NULL;
    }
    httpd_resp_set_type(req, "text/plain");
    if (s_dap_cap) {
        s_dap_cap[s_dap_cap_len] = '\0';
        /*
         * Only if there is something to send.  A zero-length chunk is the
         * terminator in chunked encoding, so sending the buffer unconditionally
         * ended the response before the verdict went out - an endpoint that
         * logged nothing returned 200 with an empty body, which reads exactly
         * like a handler that crashed.
         */
        if (s_dap_cap_len > 0) {
            httpd_resp_send_chunk(req, s_dap_cap, s_dap_cap_len);
        }
        free(s_dap_cap);
        s_dap_cap = NULL;
    }
    httpd_resp_send_chunk(req, verdict, HTTPD_RESP_USE_STRLEN);
    httpd_resp_send_chunk(req, NULL, 0);
}

