1atabey1/esp32tricore-dap/main/network/web_server.c
    /*
     * Chunked, and deliberately bounded rather than held open forever.
     *
     * esp_http_server services every request from one task, so a handler that
     * streams until the capture ends blocks the whole web server while it runs
     * - including /api/dap_trace/stop, which would leave no way to stop the
     * drain but a reset.  So this returns after DAP_TRACE_STREAM_MAX_MS, or
     * sooner if the ring goes quiet, and the host reconnects.  The 64 kB ring
     * covers the gap between requests.
     *
     * That bound is also the limit of this transport.  A sustained three-signal
     * capture is about 400 kB/s, which fills the ring in roughly 160 ms, so a
     * host that takes longer than that to reconnect loses paragraphs - and they
     * are reported as gaps rather than lost silently, which is the point of the
     * record header.  Sustained capture wants a dedicated socket with its own
     * task; this endpoint is for bring-up and for verifying the framing.
     */
    const int64_t deadline = esp_timer_get_time() + DAP_TRACE_STREAM_MAX_MS * 1000;

    uint8_t *buf = heap_caps_malloc(DAP_TRACE_CHUNK_BYTES,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (buf == NULL) {
        buf = heap_caps_malloc(DAP_TRACE_CHUNK_BYTES, MALLOC_CAP_8BIT);
    }
    if (buf == NULL) {
        httpd_resp_set_status(req, "503 Service Unavailable");
        httpd_resp_sendstr(req, "no buffer for the stream\n");
        return ESP_OK;
    }
    httpd_resp_set_type(req, "application/octet-stream");

    int idle = 0;
    for (;;) {
        const size_t n = dap_trace_read(buf, DAP_TRACE_CHUNK_BYTES);

        if (n) {
            idle = 0;
            if (httpd_resp_send_chunk(req, (const char *)buf, n) != ESP_OK) {
                break;                  /* the host went away */
            }
            if (esp_timer_get_time() >= deadline) {
                break;                  /* hand the server back; the host returns */
            }
            continue;                   /* there may be more waiting already */
        }

        dap_trace_stats_t st;
        dap_trace_get_stats(&st);
        if (!st.running && idle > DAP_TRACE_DRAIN_TAIL_PASSES) {
            break;                      /* stopped, and the ring has run dry */
        }
        if (idle > DAP_TRACE_IDLE_PASSES || esp_timer_get_time() >= deadline) {
            break;                      /* nothing arriving; do not hold the server */
        }
        idle++;
        vTaskDelay(pdMS_TO_TICKS(5));
    }
    free(buf);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

/* ------------------------------------------------------------------------ */
/* Trace over a WebSocket                                                     */
/* ------------------------------------------------------------------------ */

/*
 * Why this exists alongside /api/dap_trace/stream.
 *
 * esp_http_server runs every request from one task, so a plain HTTP response
 * that streamed for the length of a capture would block every other endpoint -
 * including /api/dap_trace/stop, which would leave no way to stop the drain but
 * a reset.  The chunked endpoint therefore returns after about a second and the
 * client reconnects, and the gap between requests is covered by a 64 kB ring
 * that a three-signal capture fills in roughly 160 ms.  It works for bring-up
 * and it is not a transport for a sustained capture.
 *
 * A WebSocket has neither problem.  The handler returns as soon as the upgrade
 * is done, so the server task is free, and the frames are pushed afterwards
 * from a task of this file's own through httpd_ws_send_frame_async.  There is
 * no reconnect, so there is no window in which the ring has to hold anything.
 *
 * One connection at a time, deliberately: the drained stream is consumed
 * destructively - dap_trace_read() empties the ring - so two readers would each
 * get an arbitrary half of the capture, which is worse than a refusal.
 */

#define TRACE_WS_CHUNK   4096
#define TRACE_WS_IDLE_MS 5

static httpd_handle_t s_trace_ws_hd;
static int            s_trace_ws_fd = -1;
static TaskHandle_t   s_trace_ws_task;
static volatile bool  s_trace_ws_run;

static void trace_ws_close(void)
{
    s_trace_ws_fd = -1;
    s_trace_ws_hd = NULL;
    s_trace_ws_run = false;
}

/*
 * Push whatever the drain has produced, for as long as the socket lives.
 *
 * Sends are synchronous from this task's point of view but asynchronous with
 * respect to the server task, which is the whole point.  A failed send means
 * the peer is gone: there is nothing useful to do but stop, and continuing
 * would spin on a dead descriptor.
 */
static void trace_ws_task(void *arg)
{
    uint8_t *buf = heap_caps_malloc(TRACE_WS_CHUNK,
                                    MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (buf == NULL) {
        buf = heap_caps_malloc(TRACE_WS_CHUNK, MALLOC_CAP_8BIT);
    }
    if (buf == NULL) {
        ESP_LOGE(TAG, "trace ws: no buffer");
        trace_ws_close();
        s_trace_ws_task = NULL;
        vTaskDelete(NULL);
        return;
    }

    ESP_LOGI(TAG, "trace ws: streaming to fd %d", s_trace_ws_fd);

    while (s_trace_ws_run && s_trace_ws_fd >= 0) {
        const size_t n = dap_trace_read(buf, TRACE_WS_CHUNK);

        if (n == 0) {
            vTaskDelay(pdMS_TO_TICKS(TRACE_WS_IDLE_MS));
            continue;
        }

        httpd_ws_frame_t pkt = {
            .final   = true,
            .type    = HTTPD_WS_TYPE_BINARY,
            .payload = buf,
            .len     = n,
        };

        const esp_err_t err = httpd_ws_send_frame_async(s_trace_ws_hd,
                                                        s_trace_ws_fd, &pkt);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "trace ws: send failed (%s); closing",
                     esp_err_to_name(err));
            break;
        }
    }

    ESP_LOGI(TAG, "trace ws: stopped");
    free(buf);
    trace_ws_close();
    s_trace_ws_task = NULL;
    vTaskDelete(NULL);
}

