1atabey1/esp32tricore-dap/main/network/web_server.c
/*
 * GET /ws/trace - the upgrade, and nothing else.
 *
 * esp_http_server calls this once with method GET to perform the handshake and
 * again for every frame the client sends.  The sender task is started on the
 * handshake; incoming frames are read and discarded, because the client has
 * nothing to say - it stops by closing, and /api/dap_trace/stop remains
 * reachable throughout precisely because this handler does not linger.
 */
static esp_err_t trace_ws_handler(httpd_req_t *req)
{
    if (req->method == HTTP_GET) {
        if (s_trace_ws_fd >= 0) {
            ESP_LOGW(TAG, "trace ws: already streaming to fd %d",
                     s_trace_ws_fd);
            return ESP_FAIL;      /* refuse rather than split the stream */
        }
        s_trace_ws_hd  = req->handle;
        s_trace_ws_fd  = httpd_req_to_sockfd(req);
        s_trace_ws_run = true;

        if (xTaskCreate(trace_ws_task, "trace_ws", 4096, NULL, 5,
                        &s_trace_ws_task) != pdPASS) {
            ESP_LOGE(TAG, "trace ws: could not start the sender");
            trace_ws_close();
            return ESP_FAIL;
        }
        return ESP_OK;
    }

    /*
     * A frame from the client.  Read it so the socket does not stall, and use
     * it only to notice a close.
     */
    httpd_ws_frame_t pkt = {0};
    uint8_t scratch[64];

    pkt.payload = scratch;
    if (httpd_ws_recv_frame(req, &pkt, sizeof(scratch)) != ESP_OK) {
        s_trace_ws_run = false;
        return ESP_OK;
    }
    if (pkt.type == HTTPD_WS_TYPE_CLOSE) {
        ESP_LOGI(TAG, "trace ws: client closed");
        s_trace_ws_run = false;
    }
    return ESP_OK;
}

httpd_uri_t uri_trace_ws = {
    .uri          = "/ws/trace",
    .method       = HTTP_GET,
    .handler      = trace_ws_handler,
    .user_ctx     = NULL,
    .is_websocket = true,
};

/*
 * POST /api/fpga_load - configure the FPGA from an uploaded bitstream.
 *
 * Loaded at runtime rather than swapped into the embedded image on purpose.
 * The DAP-only bitstream replaces the logic analyser, XVC and the Port C
 * passthrough that the CPU-driven DAP path runs over, so if it is wrong there
 * is nothing left to debug it with.  Loading it transiently means the boot
 * default stays the stock image and a reboot is the whole recovery procedure.
 *
 *     curl -sk -u admin:admin --data-binary @dap_master.bin \
 *          https://<board>/api/fpga_load
 */
/*
 * GET /api/fpga_image?sel=dap|stock - which bitstream boots, and load it now.
 *
 * The two are mutually exclusive: the DAP image replaces the logic analyser,
 * XVC and the Port C passthrough the CPU-driven DAP path runs over.  DAP is
 * the default, so this is mainly the way back - and it matters that it exists
 * without needing a host holding the other bitstream file, which is all
 * /api/fpga_load can offer.
 *
 * With no `sel` it reports the current setting and changes nothing.
 */
static esp_err_t fpga_image_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    char query[64] = {0};
    char sel[16]   = {0};
    bool have_sel = false;

    if (httpd_req_get_url_query_str(req, query, sizeof(query)) == ESP_OK &&
        httpd_query_key_value(query, "sel", sel, sizeof(sel)) == ESP_OK) {
        have_sel = true;
    }

    if (have_sel) {
        if (strcmp(sel, "dap") != 0 && strcmp(sel, "stock") != 0) {
            httpd_resp_set_status(req, "400 Bad Request");
            httpd_resp_sendstr(req, "sel must be dap or stock\n");
            return ESP_OK;
        }
        if (storage_write(FPGA_IMAGE_KEY, sel, strlen(sel) + 1) != ESP_OK) {
            httpd_resp_set_status(req, "500 Internal Server Error");
            httpd_resp_sendstr(req, "could not save the setting\n");
            return ESP_OK;
        }
    }

    char *current = NULL;
    const bool stock = (storage_alloc_and_read(FPGA_IMAGE_KEY, &current) == ESP_OK &&
                        current && strcmp(current, "stock") == 0);
    free(current);

    dap_capture_begin();

    if (have_sel) {
        extern const unsigned char bitstream_bin_start[]  asm("_binary_bitstream_bin_start");
        extern const unsigned char bitstream_bin_end[]    asm("_binary_bitstream_bin_end");
        extern const unsigned char dap_master_bin_start[] asm("_binary_dap_master_bin_start");
        extern const unsigned char dap_master_bin_end[]   asm("_binary_dap_master_bin_end");

        /* The fabric is about to be replaced, so the host's picture of it is
         * stale either way - see dap_phy_fpga_invalidate(). */
        dap_phy_fpga_invalidate();

        const gpio_config_t cfg_out = {
            .mode         = GPIO_MODE_OUTPUT,
            .pin_bit_mask = (1ULL << AEL_PIN_NUM_CLK) | (1ULL << AEL_PIN_NUM_MOSI),
            .pull_up_en   = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type    = GPIO_INTR_DISABLE,
        };
        const gpio_config_t cfg_in = {
            .mode         = GPIO_MODE_INPUT,
            .pin_bit_mask = (1ULL << AEL_PIN_NUM_MISO),
            .pull_up_en   = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type    = GPIO_INTR_DISABLE,
        };
        gpio_config(&cfg_out);
        gpio_config(&cfg_in);

        const uint8_t status = stock
            ? ICE_FPGA_Config(bitstream_bin_start,
                              (uint32_t)(bitstream_bin_end - bitstream_bin_start))
            : ICE_FPGA_Config(dap_master_bin_start,
                              (uint32_t)(dap_master_bin_end - dap_master_bin_start));
        ESP_LOGW(TAG, "loaded the %s bitstream: CDONE %s", stock ? "stock" : "DAP",
                 status == 0 ? "up" : "DID NOT COME UP");
    }

    char verdict[96];
    snprintf(verdict, sizeof(verdict), "\n=== boot bitstream: %s ===\n",
             stock ? "stock" : "DAP master");
    dap_capture_end(req, verdict);
    return ESP_OK;
}

static esp_err_t fpga_load_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

