1atabey1/esp32tricore-dap/main/network/web_server.c
httpd_uri_t uri_get_main_page = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = website_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_logo = {
    .uri = "/ez32.svg",
    .method = HTTP_GET,
    .handler = ez32_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_favicon = {
    .uri = "/favicon.ico",
    .method = HTTP_GET,
    .handler = favicon_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_set_credentials = {
    .uri = "/set_credentials",
    .method = HTTP_POST,
    .handler = set_credentials_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_get_credentials = {
    .uri = "/get_credentials",
    .method = HTTP_GET,
    .handler = get_credentials_handler,
    .user_ctx = NULL
};


httpd_uri_t uri_file_upload = {
    .uri       = "/upload/*",
    .method    = HTTP_POST,
    .handler   = file_upload_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_file_delete = {
    .uri       = "/delete/*",
    .method    = HTTP_POST,
    .handler   = file_delete_handler,
    .user_ctx  = NULL
};

httpd_uri_t uri_logic_analyzer = {
    .uri = "/logic_analyzer.html",
    .method = HTTP_GET,
    .handler = logic_analyzer_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_trace_page = {
    .uri = "/trace.html",
    .method = HTTP_GET,
    .handler = trace_page_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_help = {
    .uri = "/help",
    .method = HTTP_GET,
    .handler = help_handler,
    .user_ctx = NULL
};
/*
httpd_uri_t uri_logic_analyzer_data = {
    .uri = "/logic_analyzer_data",
    .method = HTTP_GET,
    .handler = logic_analyzer_data_handler,
    .user_ctx = NULL
};
*/
httpd_uri_t uri_log_error = {
    .uri = "/log_error",
    .method = HTTP_POST,
    .handler = log_error_handler,
    .user_ctx = NULL
};

esp_err_t not_found_handler(httpd_req_t *req, httpd_err_code_t err_code)
{
    httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "The requested URI was not found on this server.");
    return ESP_OK;
}

httpd_uri_t uri_capture_data= {
    .uri = "/capture_data",
    .method = HTTP_GET,
    .handler = capture_data_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_status = {
    .uri      = "/la_status",
    .method   = HTTP_GET,
    .handler  = la_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_instant_capture = {
    .uri      = "/instant_capture",
    .method   = HTTP_GET,
    .handler  = la_instant_capture_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_start_capture = {
    .uri      = "/la_start_capture",
    .method   = HTTP_GET,
    .handler  = la_start_capture_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_configure = {
    .uri      = "/la_configure",
    .method   = HTTP_POST,
    .handler  = la_configure_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_la_get_settings = {
    .uri      = "/la_get_settings",
    .method   = HTTP_GET,
    .handler  = la_get_settings_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_version = {
    .uri      = "/api/version",
    .method   = HTTP_GET,
    .handler  = version_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_reset_target = {
    .uri      = "/api/reset_target",
    .method   = HTTP_POST,
    .handler  = reset_target_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_uart_debug = {
    .uri      = "/api/uart_debug",
    .method   = HTTP_GET,
    .handler  = uart_debug_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_sreset_config = {
    .uri      = "/api/sreset_config",
    .method   = HTTP_POST,
    .handler  = sreset_config_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_portd_output = {
    .uri      = "/api/portd_output",
    .method   = HTTP_POST,
    .handler  = portd_output_handler,
    .user_ctx = NULL
};

/* POST /api/portd_freq
 * Body: {"freq_hz": 0|125|250|500|1000}
 * Starts a square-wave toggle on Port D pins 0-3.  freq_hz=0 stops and
 * tristates.  Requires Port D in Logic Analyzer mode (not XVC). */
static esp_err_t portd_freq_handler(httpd_req_t *req)
{
    if (check_auth(req) != ESP_OK) return ESP_OK;

    cJSON *root = cJSON_CreateObject();

    if (gbl_pd_cfg != PD_LOGICANALYZER) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Port D must be configured as Logic Analyzer (not XVC)");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    char buf[128] = {0};
    int received = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (received <= 0) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Empty body");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    cJSON *body = cJSON_Parse(buf);
    uint32_t freq_hz = 0;
    if (body) {
        cJSON *f = cJSON_GetObjectItem(body, "freq_hz");
        if (cJSON_IsNumber(f)) freq_hz = (uint32_t)f->valueint;
        cJSON_Delete(body);
    }

    if (freq_hz != 0 && freq_hz != 125 && freq_hz != 250 && freq_hz != 500 && freq_hz != 1000) {
        cJSON_AddStringToObject(root, "status",  "error");
        cJSON_AddStringToObject(root, "message", "Invalid freq_hz — valid: 0, 125, 250, 500, 1000");
        char *js = cJSON_PrintUnformatted(root);
        cJSON_Delete(root);
        httpd_resp_set_status(req, "400 Bad Request");
        httpd_resp_set_type(req, "application/json");
        httpd_resp_sendstr(req, js);
        free(js);
        return ESP_OK;
    }

    set_portd_freq(freq_hz);

    cJSON_AddStringToObject(root, "status", "ok");
    cJSON_AddNumberToObject(root, "freq_hz", (double)freq_hz);
    char *js = cJSON_PrintUnformatted(root);
    cJSON_Delete(root);
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr(req, js);
    free(js);
    return ESP_OK;
}

httpd_uri_t uri_portd_freq = {
    .uri      = "/api/portd_freq",
    .method   = HTTP_POST,
    .handler  = portd_freq_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_start = {
    .uri      = "/test/start",
    .method   = HTTP_POST,
    .handler  = test_start_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_status = {
    .uri      = "/test/status",
    .method   = HTTP_GET,
    .handler  = test_status_handler,
    .user_ctx = NULL
};

httpd_uri_t uri_test_result = {
    .uri      = "/test/result",
    .method   = HTTP_GET,
    .handler  = test_result_handler,
    .user_ctx = NULL
};

