1atabey1/esp32tricore-dap/main/network/web_server.c
/*
 * Plain HTTP, not HTTPS.
 *
 * This probe sits on a bench network and every client is a browser on the same
 * LAN, so TLS was buying a certificate warning rather than security - the
 * certificate is self-signed and checked in, which anyone on that network can
 * read.  What it cost was real: mbedTLS on an ESP32 encrypts every byte of the
 * trace stream in software, and the trace stream is the one thing here that is
 * supposed to run at over a megabyte a second.  The websocket added in the
 * previous commit was a wss:// socket for exactly that reason and could not
 * have reached the rate the drain produces.
 *
 * The credentials still apply: check_auth() runs on every endpoint as before.
 * They now travel in the clear, which on a bench LAN they effectively did
 * anyway.  If this ever faces a network that is not a bench, the answer is a
 * real certificate and a reverse proxy, not a self-signed one on the probe.
 */
esp_err_t web_server_start(httpd_handle_t *http_handle) {
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    /*
     * 34 handlers are registered below, and httpd_register_uri_handler()
     * returns an error rather than complaining loudly when the table is full -
     * so a cap set too low takes the *last* endpoints registered off the air
     * with no sign of it but a 404.  Kept well clear of the count.
     */
    config.max_uri_handlers = 56;
    config.stack_size = 10240;
    /*
     * The trace websocket holds one socket for the length of a capture, and
     * the flasher's upload holds another.  The default of four leaves too
     * little room for a browser that also wants the page and its polling.
     */
    config.max_open_sockets = 7;
    config.lru_purge_enable = true;
    config.server_port = 80;

    ESP_LOGI(TAG, "Starting HTTP server on port %d", config.server_port);
    esp_err_t ret = httpd_start(http_handle, &config);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start web server! Error: %d", ret);
        return ret;
    }

    httpd_register_uri_handler(*http_handle, &uri_get_main_page);
    httpd_register_uri_handler(*http_handle, &uri_get_logo);
    httpd_register_uri_handler(*http_handle, &uri_get_favicon);
    httpd_register_uri_handler(*http_handle, &uri_set_credentials);
    httpd_register_uri_handler(*http_handle, &uri_get_credentials);
    httpd_register_uri_handler(*http_handle, &uri_file_upload);
    httpd_register_uri_handler(*http_handle, &uri_file_delete);
    httpd_register_uri_handler(*http_handle, &uri_logic_analyzer);
    httpd_register_uri_handler(*http_handle, &uri_trace_page);
    httpd_register_uri_handler(*http_handle, &uri_trace_ws);

    /* The flasher's page and its three endpoints, registered together from
     * the module that owns them. */
    flash_web_register(*http_handle);
    httpd_register_uri_handler(*http_handle, &uri_help);
    //httpd_register_uri_handler(*http_handle, &uri_logic_analyzer_data);
    httpd_register_uri_handler(*http_handle, &uri_log_error);
    httpd_register_uri_handler(*http_handle, &uri_ota_upload);
    httpd_register_uri_handler(*http_handle, &uri_reset_to_factory);
    httpd_register_uri_handler(*http_handle, &uri_dap_spi);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_start);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_selftest);
    httpd_register_uri_handler(*http_handle, &uri_fpga_image);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_stop);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_stats);
    httpd_register_uri_handler(*http_handle, &uri_dap_trace_stream);
    httpd_register_uri_handler(*http_handle, &uri_fpga_load);
    httpd_register_uri_handler(*http_handle, &uri_fpga_pins);
    httpd_register_uri_handler(*http_handle, &uri_dap_fpga);
    httpd_register_uri_handler(*http_handle, &uri_dap_gdb_attach);
    httpd_register_uri_handler(*http_handle, &uri_dap_flash_probe);
    httpd_register_uri_handler(*http_handle, &uri_dap_gdb_status);
    httpd_register_uri_handler(*http_handle, &uri_dap_bringup);

    httpd_register_err_handler(*http_handle, HTTPD_404_NOT_FOUND, not_found_handler);
    ESP_ERROR_CHECK(uart_websocket_add_handlers(*http_handle));

    httpd_register_uri_handler(*http_handle, &uri_la_start_capture);
    httpd_register_uri_handler(*http_handle, &uri_la_status);
    httpd_register_uri_handler(*http_handle, &uri_la_instant_capture);
    httpd_register_uri_handler(*http_handle, &uri_capture_data);
    httpd_register_uri_handler(*http_handle, &uri_la_configure);
    httpd_register_uri_handler(*http_handle, &uri_la_get_settings);
    httpd_register_uri_handler(*http_handle, &uri_version);
    httpd_register_uri_handler(*http_handle, &uri_reset_target);
    httpd_register_uri_handler(*http_handle, &uri_uart_debug);
    httpd_register_uri_handler(*http_handle, &uri_sreset_config);
    httpd_register_uri_handler(*http_handle, &uri_portd_output);
    httpd_register_uri_handler(*http_handle, &uri_portd_freq);

    // Test automation endpoints
    httpd_register_uri_handler(*http_handle, &uri_test_start);
    httpd_register_uri_handler(*http_handle, &uri_test_status);
    httpd_register_uri_handler(*http_handle, &uri_test_result);
    
    // We cannot free the buffers here if httpd_ssl_start uses them by reference!
    // Documentation for httpd_ssl_start isn't explicit if it copies.
    // However, usually mbedtls parses it into its own context.
    // BUT httpd server keeps the config struct?
    // Actually, checking standard implementation: httpd_ssl_start creates a session and usually the context persists.
    // If we free it, and it accessed it later (e.g. for new connections/re-handshake), crash.
    // Given this is the global web server, leaking 2-3KB once is acceptable vs crashing.
    // So we do NOT free them.
    
    return ret;
}
